ETeissonniere/esp32-wol/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_LWIP_LOCAL_HOSTNAME="esp32-wol"

CONFIG_ETHERNET_SPI_SUPPORT=y
CONFIG_ETHERNET_SPI_USE_W5500=y
CONFIG_ETHERNET_SPI_AUTOCONFIG_MAC_ADDR0=y
CONFIG_ETHERNET_SPI_CS0_GPIO=14
CONFIG_ETHERNET_SPI_PHY_RST0_GPIO=9
CONFIG_ETHERNET_SPI_INT0_GPIO=10
CONFIG_ETHERNET_SPI_SCLK_GPIO=13
CONFIG_ETHERNET_SPI_MOSI_GPIO=11
CONFIG_ETHERNET_SPI_MISO_GPIO=12